{"withdrawn":null,"children":null,"comments":null,"region_abbr":"SC","postal_code":"29609","latitude":"34.9132","url":"http://eventful.com/greenville/venues/independent-public-alehouse-/V0-001-007408432-1?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"V0-001-007408432-1","address":"110 Poinsett Highway","metro":null,"links":{"link":[{"time":"2016-01-09 04:44:24","user_reputation":null,"url":"http://ipagreenville.com/","id":"33262217","type":"Official Site","description":null,"username":"evdb"},{"time":"2016-11-29 09:00:04","user_reputation":null,"url":"http://www.ipagreenville.com/","id":"33283438","type":"Official Site","description":null,"username":"evdb"}]},"images":null,"withdrawn_note":null,"longitude":"-82.3863","country_abbr":"USA","name":"Independent Public Alehouse","region":"South Carolina","description":null,"properties":null,"modified":"2017-05-17 00:59:09","venue_display":"1","parents":null,"geocode_type":"Zip Code Based GeoCodes","tz_olson_path":"America/New_York","city":"Greenville","trackbacks":null,"country":"United States","owner":"evdb","country_abbr2":"US","tags":null,"venue_type":"address","created":"2013-10-19 04:32:40","events":{"event":[{"stop_time":null,"start_time":"2017-05-24 21:00:00","url":"http://eventful.com/greenville/events/wed-524-kg-presents-levitation-jones-ipa-gree-/E0-001-103046770-5?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-103046770-5","title":"Wed 5/24 / KG Presents Levitation Jones / IPA / Greenville, SC","description":" KARMA GROOVES presents LEVITATION JONES “Whether You Like It Or Not” IPA - Greenville, SC Wednesday May 24, 2017 ________________________________ LEVITATION JONES soundcloud.com/levitationjones facebook.com/levitationjones Those looking for a top 40 DJ to keep toes tapping have come to the wrong place. For Levitation Jones, peculiarity has always been nothing more than the norm, and compromise has never been a part of the equation. Instead, it’s all about attitude, and Levitation Jones simply does not pay mind to expectations, acknowledging that “professionalism” is rather subjective. After all, we all have our own style of art to express. That approach has been enigmatic to his rise as one of the most celebrated and renowned names in independent bass music, bustling from coast to coast, all whilst spreading a dark cadence of sub-bass. Levitation Jones, Brian Gardner, steps up to the plate with quite a surprising, rule bending, curve ball approach, stretching the spectrum of bass physics as well as the “rules” and testing the limits of what a sound system and audience can handle. This quickly rising producer blends his original productions with heavy influences of underground dubstep and future bass paired with a seemingly effortless style of live mixing, pulling his audience in for a trip to the depths of the strange and the weird. — Known vastly for NEVER planning a set and continuously testing audiences mental comfortability with more than unique sounds of his own creation paired with a thirst for digging up and rinsing out the most unheard of, yet top shelf plates, Levitation Jones ALWAYS delivers a new masterpiece of crowd, er… well, mind control to every single set.  As the year 2017 begins to unfold, Levitation Jones is ready to reveal his most extensive tour to date, covering over 40 cities, and reaching unabashedly from the pacific to atlantic. The next perilous chapter in the New England bass physicist’s saga brings an immersive new element to an already decisive live performance. Along with him, Jones will cart an additional 75k watts of lethal Danley Soundlabs state of the art low-end technology.  Levitation Jones frequently shares the stage with renowned acts such as: G Jones, Space Jesus, Bleep Bloop, Yheti, The Widdler, TRUTH, EPROM, and an incredibly long list of other dons and champions. With Support From: LUDGE ORCHESTROBE MCBOOM IPA 110 Poinsett Hwy Greenville, SC  "},{"stop_time":null,"start_time":"2017-05-26 21:30:00","url":"http://eventful.com/greenville/events/fri-may-26-kg-presents-crywolf-live-ipa-green-/E0-001-102981835-6?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-102981835-6","title":"Fri May 26 / KG presents CRYWOLF: Live / IPA / Greenville, SC","description":" KG is stoked to present a Springtime soiree featuring Crywolf!  This marks the fourth consecutive year of Crywolf touching down in Greenville for another memorable & magical night at IPA! __________________________________ Karma Grooves Presents CRYWOLF -LIVE- Friday, May 26, 2017 IPA – Greenville, SC ——————————————— CRYWOLF  //Los Angeles, CA www.soundcloud.com/crywolf www.twitter.com/runcrywolf www.instagram.com/runcrywolf Crywolf, otherwise known as Justin Taylor Phillips, is a producer, vocalist, and multi-instrumentalist from Los Angeles, CA. Since Crywolf&#39;s conception four years ago, his intimate, melodic, avant­garde releases have garnered their own unique following, with a loyalty rarely seen in the world of electronic music. His releases are no stranger to commercial success either; met with support from international acts such as Ellie Goulding, Skrillex, Bassnectar and more. His first four EPs all charted in the top 3 on itunes and secured spots on the Billboard charts for over two weeks. His debut full-length LP, Cataclasm was hailed as his best work to date, debuting in the top 10 on Billboard electronic, and has been covered by major media outlets such as Billboard, Vice, DJ Magazine, and more. Coming off his first headline tour in 2016, Crywolf saw sold out shows in Seattle, Los Angeles, Austin, and Denver and is poised to make a huge buzz in the festival world come summer 2017. With almost 150 million total plays across online streaming platforms such as Pandora, Soundcloud, Youtube, and Spotify, and his recently released EP, Skeletons, receiving rave reviews from Nylon and the nest on top of top 5 Billboard chartings, 2017 is set to be a huge year for Crywolf &quot;Crywolf is the sort of jack of all trades who makes larger than life tracks that are hard to fully experience in one listen... powerful swells of sound that eventually unfold into more ethereal, intricate valleys, offering the listener the sort of 360 experience that makes you feel something real.&quot; - Vice  &quot;Crywolf doesn’t really care what everyone is doing around him. He doesn’t care to bend around a genre. He doesn’t care… at all. He exists in his own bubble, and I think that’s where his subtle brilliance comes from.&quot; - Earmilk ” ...so deep and has so much power and emotion behind the tone and lyrics, it’s crazy…I’ve truly never listened to anything quite like it.” - This Song Slaps “…one of my favorite new producers…powered tracks with electronic elements that have an amazing sound.” - This Song Is Sick SCALES //ATL, GA SOUL CANDY CRASHCOURSE + GATMAN GLDFNGR 17+ 9:30-4:00am IPA 110 Poinsett Hwy Greenville, SC "},{"stop_time":null,"start_time":"2017-06-23 20:30:00","url":"http://eventful.com/greenville/events/town-mountain-/E0-001-101819756-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-101819756-7","title":"Town Mountain","description":" $7 adv / $10 DOS Raw, soulful, and with plenty of swagger, Town Mountain, based in Asheville, NC, released their 5th studio album, Southern Crescent, on April 1, 2016 on LoHi Records. Produced and engineered by GRAMMY winner Dirk Powell, Southern Crescent was recorded in Powell’s studio The Cypress House in south-central Louisiana town of Breaux Bridge. It was mixed by Mixed by Scott Vestal at Digital Underground in Greenbrier, TN. Since it’s release the band debuted on the Grand Ole Opry and the Ryman Auditorium stages bringing their sound to new audiences. The critically acclaimed album debuted at #4 on the Billboard Bluegrass Chart while staying for ten weeks on the Americana Music Association’s radio chart’s Top 40. No Depression’s Amos Perrine names Town Mountain as, “the most exciting bluegrass band to come along in a long time,” which is echoed by Music City Roots’ Craig Havighurst’s sentiments, “I’d put Town Mountain on my list of Five Bluegrass Bands You Must Know in 2016, because while the genre has forked and morphed in wonderful ways, these guys from Asheville have more Flatt & Scruggs and more Jimmy Martin in their sound than any young band I can think of. And when they do nod to other influences, they tend to be from parallels to the early bluegrass era, like Chuck Berry and Carl Perkins for example.” Up for a 2016 Emerging Artist Award with IBMA and the 2013 winners of IBMA Momentum Awards for Performance Band and Vocalist of the Year (Robert Greer), Town Mountain has earned raves for their hard-driving sound, their in-house songwriting and the honky-tonk edge that permeates their exhilarating live performances. With an insatiable musical hunger, the members of Town Mountain are Robert Greer on vocals and guitar, Jesse Langlais on banjo and vocals, Phil Barker on mandolin and vocals, Jack Devereux on fiddle, and Adam Chaffins on bass. Please note Bobby Britt (fiddle) and Nick DiSebastian (bass) perform on the album. The album was recorded in a decidedly old-school way, live, with minimal fixes and overdubs, with all the musicians in the same room and no noise-reducing baffling between them. Each of Town Mountain’s members contributed songs to Southern Crescent, with Barker, Langlais, and Greer the chief writers in the band. "}]}}