{"withdrawn":null,"children":null,"comments":null,"region_abbr":"SC","postal_code":"29609","latitude":"34.9132","url":"http://eventful.com/greenville/venues/independent-public-alehouse-/V0-001-007408432-1?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"V0-001-007408432-1","address":"110 Poinsett Highway","metro":null,"links":{"link":[{"time":"2016-11-29 09:00:04","user_reputation":null,"url":"http://www.ipagreenville.com/","id":"33283438","type":"Official Site","description":null,"username":"evdb"},{"time":"2016-01-09 04:44:24","user_reputation":null,"url":"http://ipagreenville.com/","id":"33262217","type":"Official Site","description":null,"username":"evdb"}]},"images":null,"withdrawn_note":null,"longitude":"-82.3863","country_abbr":"USA","name":"Independent Public Alehouse","region":"South Carolina","description":null,"properties":null,"modified":"2017-04-18 00:58:49","venue_display":"1","parents":null,"geocode_type":"Zip Code Based GeoCodes","tz_olson_path":"America/New_York","city":"Greenville","trackbacks":null,"country":"United States","owner":"evdb","country_abbr2":"US","tags":null,"venue_type":"address","created":"2013-10-19 04:32:40","events":{"event":[{"stop_time":null,"start_time":"2017-04-20 16:20:00","url":"http://eventful.com/greenville/events/love-bomb-presents-420-celebration-w-larry-keel-/E0-001-101117885-5?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-101117885-5","title":"Love Bomb Presents: A 4/20 Celebration w/ The Larry Keel Experience+ more!","description":" Join us on Thursday, April 20th for a celebration! Love Bomb Presents and IPA is bringing the great tunes with The Larry Keel Experience, Jahman Brahman, West End String Band, Universal Sigh and maybe more! Cannabis Forward is also going to be present with all the info pertaining to cannabis&#39; medicinal value and what needs to happen to make the public more aware. Seamless music with two stages and good friends!   Ages 18 and up $15 early bird til 3/20/ $20 gen ad/ $25 dos "},{"stop_time":null,"start_time":"2017-04-28 21:30:00","url":"http://eventful.com/greenville/events/fri-april-28-kg-presents-phase-one-more-ipa-/E0-001-101335133-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-101335133-7","title":"Fri April 28 / KG presents PHASE ONE & More! / IPA / Greenville, SC","description":" KARMA GROOVES presents PHASE ONE IPA - Greenville, SC Friday, April 7, 2017 _____________________________________________ PHASE ONE // Australia www.PhaseOneAU.com www.facebook.com/PhaseOneAU/ www.soundcloud.com/PhaseOneAU With numerous consecutive Beatport number 1s, millions of Soundcloud & YouTube plays, collaborations & remixes for Excision, Virtual Riot, Megalodon, Northlane, In Hearts Wake plus many more under his belt, few can deny that PhaseOne is one of the most consistent and significant talents to emerge from the Australian Music scene in the last few years, with his distinct sound combining a unique blend of hard hitting Electronic Bass Music with a Hardcore/Metal fusion. PhaseOne got his start with Datsik’s label ‘Firepower Records’, notable releases include two chart topping original EP’s; ‘Touching The Stars’ and ‘Matter Of Time’, also hit singles ‘UFO’ and sequel track ‘Area 51’ both held down the #1 spot on Beatport for weeks on end. He has toured USA, Canada, Europe, Australia and the Asia Pacific Region extensively with some of the biggest names in the industry. His music gaining DJ support from acts such as Skrillex, Datsik, Excision to name a few. With his recent exclusive signing with Disciple Records he released his chart topping EP &quot;Origins&quot;. This young music producer is one to look out for in 2017. AMBITION //Tampa, FL B2B ROC-IT MAATTICUS ALCHEMY 17+ Tickets: KarmaGrooves.com IPA 110 Poinsett Hwy Greenville, SC "},{"stop_time":null,"start_time":"2017-05-06 20:00:00","url":"http://eventful.com/greenville/events/almost-kings-/E0-001-102206302-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-102206302-7","title":"Almost Kings","description":" You saw them at Blind Horse and now they return to Greenville Sc to rock IPA. 18 to party and 21 to drink. 8pm start up time. $10 Pre sale tickets and $12 at the door the day of. Come party with us. "},{"stop_time":null,"start_time":"2017-06-23 20:30:00","url":"http://eventful.com/greenville/events/town-mountain-/E0-001-101819756-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-101819756-7","title":"Town Mountain","description":" $7 adv / $10 DOS Raw, soulful, and with plenty of swagger, Town Mountain, based in Asheville, NC, released their 5th studio album, Southern Crescent, on April 1, 2016 on LoHi Records. Produced and engineered by GRAMMY winner Dirk Powell, Southern Crescent was recorded in Powell’s studio The Cypress House in south-central Louisiana town of Breaux Bridge. It was mixed by Mixed by Scott Vestal at Digital Underground in Greenbrier, TN. Since it’s release the band debuted on the Grand Ole Opry and the Ryman Auditorium stages bringing their sound to new audiences. The critically acclaimed album debuted at #4 on the Billboard Bluegrass Chart while staying for ten weeks on the Americana Music Association’s radio chart’s Top 40. No Depression’s Amos Perrine names Town Mountain as, “the most exciting bluegrass band to come along in a long time,” which is echoed by Music City Roots’ Craig Havighurst’s sentiments, “I’d put Town Mountain on my list of Five Bluegrass Bands You Must Know in 2016, because while the genre has forked and morphed in wonderful ways, these guys from Asheville have more Flatt & Scruggs and more Jimmy Martin in their sound than any young band I can think of. And when they do nod to other influences, they tend to be from parallels to the early bluegrass era, like Chuck Berry and Carl Perkins for example.” Up for a 2016 Emerging Artist Award with IBMA and the 2013 winners of IBMA Momentum Awards for Performance Band and Vocalist of the Year (Robert Greer), Town Mountain has earned raves for their hard-driving sound, their in-house songwriting and the honky-tonk edge that permeates their exhilarating live performances. With an insatiable musical hunger, the members of Town Mountain are Robert Greer on vocals and guitar, Jesse Langlais on banjo and vocals, Phil Barker on mandolin and vocals, Jack Devereux on fiddle, and Adam Chaffins on bass. Please note Bobby Britt (fiddle) and Nick DiSebastian (bass) perform on the album. The album was recorded in a decidedly old-school way, live, with minimal fixes and overdubs, with all the musicians in the same room and no noise-reducing baffling between them. Each of Town Mountain’s members contributed songs to Southern Crescent, with Barker, Langlais, and Greer the chief writers in the band. "}]}}