{"withdrawn":null,"children":null,"comments":null,"region_abbr":"SC","postal_code":"29609","latitude":"34.9132","url":"http://eventful.com/greenville/venues/independent-public-alehouse-/V0-001-007408432-1?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"V0-001-007408432-1","address":"110 Poinsett Highway","metro":null,"links":{"link":[{"time":"2016-11-29 09:00:04","user_reputation":null,"url":"http://www.ipagreenville.com/","id":"33283438","type":"Official Site","description":null,"username":"evdb"},{"time":"2016-01-09 04:44:24","user_reputation":null,"url":"http://ipagreenville.com/","id":"33262217","type":"Official Site","description":null,"username":"evdb"}]},"images":null,"withdrawn_note":null,"longitude":"-82.3863","country_abbr":"USA","name":"Independent Public Alehouse","region":"South Carolina","description":null,"properties":null,"modified":"2016-12-28 01:10:07","venue_display":"1","parents":null,"geocode_type":"Zip Code Based GeoCodes","tz_olson_path":"America/New_York","city":"Greenville","trackbacks":null,"country":"United States","owner":"evdb","country_abbr2":"US","tags":null,"venue_type":"address","created":"2013-10-19 04:32:40","events":{"event":[{"stop_time":null,"start_time":"2017-01-07 20:00:00","url":"http://eventful.com/greenville/events/rims-keys-wejp-ipa-/E0-001-098582979-6?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-098582979-6","title":"Rims & Keys W/EJP at IPA!","description":" Love Bomb Presents: Rims & Keys w/EJP live at IPA!       January 7th, 2017 Genre: Gangsta Jazz and Jazztronica                                            $5adv/$7dos  21 and up with ID 21 and under with ID $10  Showcasing two livetronica acts from the southeast!!  Rims & Keys: Ganstajazz from TN https://soundcloud.com/rimsandkeys www.reverbnation.com/rpk/rimskeys The innovators of Gangsta-Jazz, This duo is bridging the gap between the hot beats of the dirty south and the smooth sensual movements of John Coltrane and Miles Davis. Rims & Keys features Jay Rims and Jordan Adams, two brothers who decided to join together to combine the many genres that has inspired them over the years from Big Band to Hip hop to rock and roll and everything in between into one electrifying sound adding elements of both live band and production this duo is sure to please even the pickiest of music lovers.  Electric Jazz Project: Jazztronica from Greenville,SC http://soundcloud.com/TheElectricJazzProjecthttp://www.youtube.com/ElectricJazzProjecthttp://www.ElectricJazzProject.bandcamp.com Biography The Electric Jazz Project can be described as a creative fusion of smooth grooving melodies and head banging beats. Their implication of jazz theory with the steady rhythm and precision of EDM gives the electric jazz project a unique sound that can bring listeners to a euphoric paradise. By combining live improvisation with carefully crafted beats and melodic textures EJP successfully blends jazz fusion with livetronica and dubstep to create wild energetic performances. "},{"stop_time":null,"start_time":"2017-01-07 20:00:00","url":"http://eventful.com/greenville/events/rims-keys-electric-jazz-project-/E0-001-098672924-4?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-098672924-4","title":"Rims & Keys- The electric Jazz Project","description":" Love Bomb Presents: Rims & Keys w/EJP live at IPA! January 7th, 2017 Genre: Gangsta Jazz and Jazztronica $5adv/$7dos 21 and up with ID 21 and under with ID $10 Showcasing two livetronica acts from the southeast!! Rims & Keys: Gangsta Jazz from Tn. https://facebook.com/rimsandkeys https://soundcloud.com/rimsandkeys The innovators of Gangsta-Jazz, This duo is bridging the gap between the hot beats of the dirty south and the smooth sensual movements of John Coltrane and Miles Davis. Rims & Keys features Jay Rims and Jordan Adams, two brothers who decided to join together to combine the many genres that has inspired them over the years from Big Band to Hip hop to rock and roll and everything in between into one electrifying sound adding elements of both live band and production this duo is sure to please even the pickiest of music lovers."},{"stop_time":null,"start_time":"2017-01-28 21:00:00","url":"http://eventful.com/greenville/events/big-something-/E0-001-098226135-3?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-098226135-3","title":"BIG Something","description":"$12 advance/15 day of showADVANCE TICKETS AVAILABLE HERE:www.bigsomething.net/tourWant to help spread the word and earn free tickets?Join our street team here:http://bit.ly/BigSomethingStreetTeamDownload our FREE mobile appbit.ly/BigApp-iPhonebit.ly/BigApp-AndroidCheck out HQ Video playlist on youtube:http://bit.ly/BigSomthingVideosRSVP &quot;going&quot; to any show & automatically enter to win FREE tickets: http://bit.ly/BigSomethingRSVP"},{"stop_time":null,"start_time":"2017-01-28 21:00:00","url":"http://eventful.com/greenville/events/big-something-wjahman-brahman-ipa-greenville-/E0-001-098873694-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-098873694-7","title":"Big Something w/Jahman Brahman at IPA, Greenville!","description":" Saturday, January 28th!  Love Bomb Presents: Big Something w/Jahman Brahman! Ages18+ Holiday Special!! A limited number of $7 tickets will be available until December 25th! Grab some for a great stocking stuffer! After that.. $10adv/$12dos Big Something: Jam/Rock/Improv from Burlington, NC A 6 piece powerhouse with a sound that is both unique and timeless, BIG Something fuses elements of rock, pop, funk, and improvisation to take listeners on a journey through a myriad of musical styles. It&#39;s no secret why this group has quickly become one of the most exciting new bands to emerge from the Southeast. Soaring guitars, synths, horns and alluring vocal hooks rise to the top of their infectious collection of songs and represent a sound that has caught the ears of such revered Summer circuit stalwarts as Galactic, moe., Robert Randolph, and even The B52s who have all tapped Big Something as direct support.The group&#39;s most recent release and 3rd full-length studio album - Truth Serum – was recorded with the help of Grammy-nominated producer John Custer. Cut almost entirely live in the studio, Truth Serum, is a great snapshot of the magic the band is capable of creating on stage. The album, which also features an appearance from DJ Logic, was named 2014 Album of the Year by The Homegrown Music Network, which makes Big Something the only band ever to win this award 3 times with 3 different releases (2010, 2013, and 2014). Join our community of friends and fans in THE MIDDLE OF NOWHERE w. BIG SOMETHING : https://www.facebook.com/groups/bigsomething/ Connect with Big Something:http://bigsomething.nethttp://twitter.com/bigsomethinghttp://instagram.com/bigsomethingofficial Jahman Brahman: Shred&#39;n&#39;flow from Asheville, NC www.JahmanBrahman.com @Jahmanbrahman Jahman Brahman is a five-member collaboration originating from Columbus, Ohio in 2007, and currently residing in the mountains of Asheville, NC. The musical intuition of each member overcomes the restrictions of any particular genre as they pioneer the musical trail with a sound completely their own. The name Jahman Brahman emerged from each member’s goal to achieve the ultimate state of musical cohesion; each instrument connected to one another to create a piece of music from the heart of one. They’ve described their particular style as shred ‘n’ flow, a dynamic sound with a wide breath of influence, but a focus on rich, fluid, progressions of energy. Providing the low end, Nate “Brother” Brown brings his own style of funked out and super fresh bass grooves. Layered on top are Daniel Combs&#39; transcendent key strokes and myriad of effects, which highlight Justin Brown’s full and conscious lyrics. Drummer Chuck Knott gives the sound its steady concrete pulse providing the heartbeat for Casey Chanatry’sriveting guitar-work. Combined, Jahman Brahman leaves the listener with a message on life, love, and the wonders experienced being part of an extraordinary musical family. Each member holds a unique passion toward many different audio paths, with influences ranging from classic rock to electronica; from punk to jazz. Instead of conforming, they ascend music through the coalescence of their diverse styles, taking risks that unfold into powerful jams and creative compositions. "},{"stop_time":null,"start_time":"2017-02-02 22:00:00","url":"http://eventful.com/greenville/events/gourmet-collective-showcase-greenville-sc-/E0-001-098951736-7?utm_source=apis&utm_medium=apim&utm_campaign=apic","id":"E0-001-098951736-7","title":"Gourmet Collective Showcase : Greenville, SC","description":" The Gourmet Collective proudly presents our first anniversary showcase, featuing the sounds and styles of 9 up and coming artist from the southeast.  On this date we bring you - KEVIN FLUM X BOOGIE T. - Riven X Devious Arque X Yuki Daniels Jack 10:00PM - 3:00AM 18+ "}]}}